wk20_hw/tweeter_app_api/app/controllers/tweets_controller.rb

    def index
        tweets = Tweet.all
---
SELECT "tweets".* FROM "tweets"

    def show
        puts params
        tweet = Tweet.find(params[:id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        tweet = Tweet.new(tweet_params)
        if tweet.save
---
INSERT INTO "tweets" ("title", "content", "author") VALUES ($1, $2, $3) RETURNING "id"  [["title", "isolation ponderings"], ["content", "If I'm excited about toilet bowl cleaner, is the isolation to blame or am I just getting old?"], ["author", "heathers989"]]

    def update
        tweet = Tweet.find(params[:id])
        tweet.update(tweet_params)
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tweets" SET "title" = $1 WHERE "tweets"."id" = $2  [["title", "Isolation ponderings part I"], ["id", 3]]